[
	{
		"1": {
			"subj":"GMA Error 1: There is an uncaught error in the code.",
			"msg":"There is an uncaught error in the code. Akshat should work on a fix as soon as possible. The traceback is given below:{traceback}"
		},
		"2": {
			"subj":"GMA Error 2: There are no FTOs found by the scrape at stage {stage}.",
			"msg":"There is no action required from the field team. The code should continue to run normally."
		},
		"3": {
			"subj":"GMA Error 3: There was an error adding the new FTO nos. in the FTO queue.",
			"msg":"In case this happens 2 days in a row, Akshat, Anwesha, or Tanya should manually update the FTO queue."
		},
		"4": {
			"subj":"GMA Error 4: There was an error creating the primary key after the FTO queue update.",
			"msg":"Akshat should log in to the database and manually create the new key."
		},
		"5": {
			"subj":"GMA Error 5: There was an error in the SQL queries which get the scraped data from the database.",
			"msg":"If this happens 2 days in a row, Akshat, Anwesha or Tanya should get the data manually."
		},
		"6": {
			"subj":"GMA Error 6: There was an error merging the transactions data with the banks and accounts tables.",
			"msg":"If this happens 2 days in a row, Akshat, Anwesha or Tanya should get the data manually."
		},
		"7": {
			"subj":"GMA Error 7: There was an error sending the scraped and merged data to a .csv file on the cloud computer.",
			"msg":"Akshat should send the transactions data to a .csv file manually."
		},
		"8": {
			"subj":"GMA Error 8: There was an error uploading the transactions .csv file to Dropbox.",
			"msg":"If this happens 2 days in a row, Akshat, Anwesha, or Tanya should rerun the Dropbox data upload manually."
		},
		"9": {
			"subj":"GMA Error 9: There was an error uploading the transactions .csv file to AWS S3 on Cyberduck.",
			"msg":"If this happens 2 days in a row, Akshat, Anwesha, or Tanya should rerun the Dropbox data upload manually."
		},
		"10": {
			"subj":"GMA Error 10: There was an error updating the FTO types in the FTO tracker.",
			"msg":"Akshat should manually run the update on the same day as this error happens."
		},
		"11": {
			"subj":"GMA Error 11: There was an error in the daily progress calculator.",
			"msg":"There is no action required from the team. Everything should continue to work normally in the next run."
		}

	}
]